Revit 2018 API
HermiteSurface Methods
The HermiteSurface type exposes the following members.
Methods
Name | Description
Create(Int32, Int32, IList<XYZ>)
 Create a non-periodic Hermite surface using a net of 3D points as input.
Create(Int32, Int32, IList<XYZ>, Boolean, Boolean)
 Create a Hermite surface using a net of 3D points as input. Specify periodicity in U and V direction.
Dispose |  (Inherited from Surface.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValid
 Checks whether this HermiteSurface object is valid.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
HermiteSurface Class
Autodesk.Revit.DB Namespace